# RepeaterCoordinates Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RepeaterCoordinates Class
Members See Also
---
Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class RepeaterCoordinates : IDisposable
```

Visual Basic
---
```text
Public Class RepeaterCoordinates _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RepeaterCoordinates : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RepeaterCoordinates
# See Also
RepeaterCoordinates Members
Autodesk.Revit.DB Namespace